usr.sbin/pivot_root/pivot_root.8
.\"     $NetBSD: pivot_root.8,v 1.14 2011/08/15 14:43:17 ast Exp $
.\"
.\" Copyright (c) 2012 Adrian Steinmann <ast at NetBSD org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd May 18, 2012
.Dt PIVOT_ROOT 8
.Sh NAME
pivot_root \- change the root file system
.Sh SYNOPSIS
.B pivot_root
.Rb \fInew_root\fP
.Rb \fIput_old\fP
.Sh DESCRIPTION
\fBpivot_root\fP moves the root file system of the current process to the
directory \fIput_old\fP and makes \fInew_root\fP the new root file system.
Since \fBpivot_root(8)\fP simply calls \fBpivot_root(2)\fP, we refer to
the man page of the latter for further details.
.Br
Note that, depending on the implementation of \fBpivot_root\fP, root and
cwd of the caller may or may not change. The following is a sequence for
invoking \fBpivot_root\fP that works in either case, assuming that
\fBpivot_root\fP and \fBchroot\fP are in the current \fBPATH\fP:
.Sp
cd \fInew_root\fP
.Br
pivot_root . \fIput_old\fP
.Br
exec chroot . \fIcommand\fP
.Sp
Note that \fBchroot\fP must be available under the old root and under the new
root, because \fBpivot_root\fP may or may not have implicitly changed the
root directory of the shell.
.Br
Note that \fBexec chroot\fP changes the running executable, which is
necessary if the old root directory should be unmounted afterwards.
Also note that standard input, output, and error may still point to a
device on the old root file system, keeping it busy. They can easily be
changed when invoking \fBchroot\fP (see below; note the absence of
leading slashes to make it work whether \fBpivot_root\fP has changed the
shell's root or not).
.Sh EXAMPLES
Change the root file system to /dev/hda1 from an interactive shell:
.Sp
.Nf
mount /dev/hda1 /new-root
cd /new-root
pivot_root . old-root
exec chroot . sh <dev/console >dev/console 2>&1
umount /old-root
.Fi
.Sp
Mount the new root file system over NFS from 10.0.0.1:/my_root and run
\fBinit\fP:
.Sp
.Nf
ifconfig lo 127.0.0.1 up   # for portmap
# configure Ethernet or such
portmap   # for lockd (implicitly started by mount)
mount -o ro 10.0.0.1:/my_root /mnt
killall portmap   # portmap keeps old root busy
cd /mnt
pivot_root . old_root
exec chroot . sh -c 'umount /old_root; exec /sbin/init' \\
  <dev/console >dev/console 2>&1
.Fi
.Sh "SEE ALSO"
.Br chroot(8),
.Br mount(8),
.Br pivot_root(2),
.Br umount(8)
